### How to create Python Pandas DataFrame

In [1]:
import pandas as pd

In [2]:
emt_df=pd.DataFrame()
print(emt_df)

Empty DataFrame
Columns: []
Index: []

In [3]:
lst=['a', 'b', 'c']
print(lst)

['a', 'b', 'c']

In [4]:
df1=pd.DataFrame(lst)
print(df1)

   0
0  a
1  b
2  c

In [5]:
df1

   0
0  a
1  b
2  c

In [6]:
ls_of_ls=[[1,2,3],[2,3,4],[3,4,5]]
print(ls_of_ls)

[[1, 2, 3], [2, 3, 4], [3, 4, 5]]

In [7]:
ls_of_ls

[[1, 2, 3], [2, 3, 4], [3, 4, 5]]

In [8]:
df2=pd.DataFrame(ls_of_ls)
df2

   0  1  2
0  1  2  3
1  2  3  4
2  3  4  5

In [9]:
dict1={'ID':{11,22,33}}
dict1

{'ID': {11, 22, 33}}

In [10]:
dict3=pd.DataFrame(dict1)
dict3

             ID
0  {33, 11, 22}
1  {33, 11, 22}
2  {33, 11, 22}

In [16]:
dict1={'ID':{11,22,33, 44}, 'SN': {1,2,3,4}}
dict1

{'ID': {11, 22, 33, 44}, 'SN': {1, 2, 3, 4}}

In [17]:
df3=pd.DataFrame(dict1)
df3

                 ID            SN
0  {33, 11, 44, 22}  {1, 2, 3, 4}
1  {33, 11, 44, 22}  {1, 2, 3, 4}
2  {33, 11, 44, 22}  {1, 2, 3, 4}
3  {33, 11, 44, 22}  {1, 2, 3, 4}

In [21]:
ls_dict=[{'a':1, 'b':2, 'c': 5}, {'a':3, 'b':4, 'c':6}]
df5=pd.DataFrame(ls_dict)
df5

   a  b  c
0  1  2  5
1  3  4  6